Revit 2027 API
FileImportedEventArgs.Format Property
 Identifies the import format, e.g. DWG or image.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportExportFileFormat Format { get; }
Public ReadOnly Property Format As ImportExportFileFormat
	Get
public:
property ImportExportFileFormat Format {
	ImportExportFileFormat get ();
}
member Format : ImportExportFileFormat with get
Property Value
ImportExportFileFormat
See Also
Reference
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace